/**
 * @filename MySqlIndex.sql
 * @description MySql - 索引
 * 索引分析
 * 创建索引
 * 删除索引
 * 修改索引
 * 查看索引
 * 索引优化
 * @author qye.zheng
 * @version 1.0
 */

/* ====================  ==================== */

/* 索引分析 */

/*
在不读取整个表的情况下，索引使db应用程序可以
更快地查找数据.

用户无法看到索引，它们只能被用来加速搜索/查询

更新一个包含索引的表需要比更新一个没有索引的表更多的时间，
这是由于索引本身也需要更新。
因此，理想的做法是仅仅在常常被搜索的列（以及表）上面创建索引。
*/

/* ====================  ==================== */

/* 创建索引 */

/* 创建 普通 索引 */
CREATE INDEX index_name ON tb_name (column_name(length));

/* 创建普通索引 */
ALTER TABLE tb_name ADD INDEX index_name(column_name);
/* ALTER TABLE tb_name ADD INDEX index_name ON (column(length)); */

/* 创建 唯一 索引 */
/* 索引的两行不能拥有相同的值 */
CREATE UNIQUE INDEX index_name ON tb_name (column_name(length));

/* 创建唯一索引 */
ALTER TABLE tb_name ADD UNIQUE index_name ON (column(length));


/* 创建 全文 索引 */
CREATE FULLTEXT INDEX index_name ON tb_name (column_name);

/* 创建全文索引 */
ALTER TABLE tb_name ADD FULLTEXT index_name ON (column);


/* 表_创建_示例 */
CREATE TABLE `person` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(50) DEFAULT NULL,
  `age` tinyint(4) DEFAULT '0',
  `sex` varchar(5) DEFAULT 'M',
  PRIMARY KEY (`id`),
  INDEX index_name(column(length))
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=UTF8;

/* ====================  ==================== */


/* 删除索引 */
DROP INDEX index_name ON tb_name;

/* ====================  ==================== */

/* ====================  ==================== */

/* 查看索引 */	
show index from tb_name;
show keys from tb_name;
/* ====================  ==================== */



/* ====================  ==================== */

/*  */

/* ====================  ==================== */

/*  */



/* ====================  ==================== */

/*  */


/* ====================  ==================== */

/*  */



/* ====================  ==================== */

/*  */	
	

/* ====================  ==================== */



/* ====================  ==================== */

/*  */

/* ====================  ==================== */

/*  */



/* ====================  ==================== */

/*  */


/* ====================  ==================== */

/*  */



/* ====================  ==================== */

/*  */	
	

/* ====================  ==================== */



/* ====================  ==================== */

/*  */

/* ====================  ==================== */

/*  */



/* ====================  ==================== */

/*  */


/* ====================  ==================== */

/*  */



/* ====================  ==================== */

/*  */	
	

/* ====================  ==================== */



/* ====================  ==================== */

/*  */

