/**
 * @filename MySqlFunction.sql
 * @description MySql - 函数
 * @author qye.zheng
 * @version 1.0
 */

/*
描述:

standard function

包括:
系统函数
聚合函数
日期时间
字符函数
数字函数
转换函数
加密函数
搜索函数
信息函数


*/

/* ====================  ==================== */

/* 系统函数 */

/* ====================  ==================== */

/* 聚合函数 */


/* ====================  ==================== */

/* 日期时间 */

/* 返回日期date的星期索引(1=星期天，2=星期一, ……7=星期六) */
DAYOFWEEK(date)

/* 返回date的星期索引(0=星期一，1=星期二, ……6= 星期天) */
WEEKDAY(date)

/* 返回date的月份中日期，在1到31范围内 */
DAYOFMONTH(date)

/* 返回date在一年中的日数, 在1到366范围内 */
DAYOFYEAR(date)

/* 返回date的星期名字 */
DAYNAME(date)

/* 返回date的月份名字 */
MONTHNAME(date)

/* 返回date的周数，范围在0到52 first=0 星期天是第一天，first=1 星期一是第一天，以此类推 */
WEEK(date, first)

/* 返回date的年份，范围在1000到9999 */
YEAR(date)

/* 返回date的月份，范围1到12 */
MONTH(date)

/* 返回date在一年中的日数, 在1到366范围内 */
DAYOFYEAR(date)

/* 返回time的小时，范围是0到23 */
HOUR(time)

/* 返回time的分钟，范围是0到59 */
MINUTE(time)

/* 回来time的秒数，范围是0到59 */
SECOND(time)

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */

/*  */


/* ====================  ==================== */

/* 字符函数 */



/* ====================  ==================== */

/* 数字函数 */

/* ====================  ==================== */

/* 转换函数 */

/* ====================  ==================== */

/* 转换函数 */

/* ====================  ==================== */

/* 加密函数 */

/* ====================  ==================== */

/* 搜索函数 */

/* ====================  ==================== */

/* 信息函数 */

/* ====================  ==================== */

/*  */

/* ====================  ==================== */

/*  */

